ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
/*------------------------------------------------------------------------------
SERIAL.C


------------------------------------------------------------------------------*/

#include "../main.h"
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h"
#include "driverlib/uart.h"
#include "utils/ringbuf.h"



//*****************************************************************************
//! The ring buffers used to hold characters received from the UARTs.
//*****************************************************************************
static tRingBufObject g_sRxBuf[MAX_S2E_PORTS];

//*****************************************************************************
//! The ring buffers used to hold characters to be sent to the UARTs.
//*****************************************************************************
static tRingBufObject g_sTxBuf[MAX_S2E_PORTS];

//*****************************************************************************
//! The base address for the UART associated with a port.
//*****************************************************************************
static const uint32_t g_ulUARTBase[MAX_S2E_PORTS] =
{
    UART0_BASE,
    UART1_BASE
};



//*****************************************************************************
//
//! Handles the UART interrupt.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function is called when either of the UARTs generate an interrupt.
//! An interrupt will be generated when data is received and when the transmit
//! FIFO becomes half empty.  The transmit and receive FIFOs are processed as
//! appropriate.
//!
//! \return None.
//
//*****************************************************************************
static void SerialUARTIntHandler(uint32_t ulPort)
{
    uint32_t ulStatus;
    uint8_t ucChar;

    // Get the cause of the interrupt.
    ulStatus = UARTIntStatus(g_ulUARTBase[ulPort], true);

    // Clear the cause of the interrupt.
    UARTIntClear(g_ulUARTBase[ulPort], ulStatus);

    // See if there is data to be processed in the receive FIFO.
    if(ulStatus & (UART_INT_RT | UART_INT_RX))
    {
        // Loop while there are characters available in the receive FIFO.
        while(UARTCharsAvail(g_ulUARTBase[ulPort]))
        {
            // Get the next character from the receive FIFO.
            ucChar = UARTCharGet(g_ulUARTBase[ulPort]);

#ifdef PROTOCOL_TELNET
            // If Telnet protocol enabled, check for incoming IAC character,
            // and escape it.
            if((g_sParameters.sPort[ulPort].ucFlags &
                        PORT_FLAG_PROTOCOL) == PORT_PROTOCOL_TELNET)
            {
                // If this is a Telnet IAC character, write it twice.
                if((ucChar == TELNET_IAC) &&
                   (RingBufFree(&g_sRxBuf[ulPort]) >= 2))
                {
                    RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
                    RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
                }

                // If not a Telnet IAC character, only write it once.
                else if((ucChar != TELNET_IAC) &&
                        (RingBufFree(&g_sRxBuf[ulPort]) >= 1))
                {
                    RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
                }
            }

            // if not Telnet, then only write the data once.
            else
#endif

            {
                RingBufWriteOne(&g_sRxBuf[ulPort], ucChar);
            }
        }
    }

#ifdef SERIAL_FLOW_CONTROL
    // If flow control is enabled, check the status of the RX buffer to
    // determine if flow control GPIO needs to be asserted.
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        // If the ring buffer is down to less than 25% free, assert the
        // outbound flow control pin.
        if(RingBufFree(&g_sRxBuf[ulPort]) <
           (RingBufSize(&g_sRxBuf[ulPort]) / 4))
        {
            GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort],
                         g_ulFlowOutPin[ulPort]);
        }
    }
#endif

    // See if there is space to be filled in the transmit FIFO.
    if(ulStatus & UART_INT_TX)
    {
        // Loop while there is space in the transmit FIFO and characters to be
        // sent.
        while(!RingBufEmpty(&g_sTxBuf[ulPort]) &&
                UARTSpaceAvail(g_ulUARTBase[ulPort]))
        {
            // Write the next character into the transmit FIFO.
            UARTCharPut(g_ulUARTBase[ulPort],
                        RingBufReadOne(&g_sTxBuf[ulPort]));
        }
    }
}

//*****************************************************************************
//
//! Handles the UART0 interrupt.
//!
//! This function is called when the UART generates an interrupt.  An interrupt
//! will be generated when data is received and when the transmit FIFO becomes
//! half empty.  The transmit and receive FIFOs are processed as appropriate.
//!
//! \return None.
//
//*****************************************************************************
void SerialUART0IntHandler(void)
{
    SerialUARTIntHandler(0);
}

//*****************************************************************************
//
//! Handles the UART1 interrupt.
//!
//! This function is called when the UART generates an interrupt.  An interrupt
//! will be generated when data is received and when the transmit FIFO becomes
//! half empty.  The transmit and receive FIFOs are processed as appropriate.
//!
//! \return None.
//
//*****************************************************************************
void SerialUART1IntHandler(void)
{
    SerialUARTIntHandler(1);
}

//*****************************************************************************
//
//! Checks the availability of the serial port output buffer.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function checks to see if there is room on the UART transmit buffer
//! for additional data.
//!
//! \return Returns the number of bytes available in the serial transmit ring
//! buffer.
//
//*****************************************************************************
bool SerialSendFull(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < MAX_S2E_PORTS);

