ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
        case 6:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_6;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        case 7:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_7;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        case 8:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_WLEN_MASK);
            ulNewConfig |= UART_CONFIG_WLEN_8;
            g_sParameters.sPort[ulPort].ucDataSize = ucDataSize;
            break;
        }

        default:
        {
            ulNewConfig = ulCurrentConfig;
            break;
        }
    }

    //
    // Set parity, data length, and number of stop bits.
    //
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) = ulNewConfig;

    //
    // Clear the flags register.
    //
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    //
    // Start the UART.
    //
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//
//! Queries the serial port data size.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured data size for the selected port.
//!
//! \return None.
//
//*****************************************************************************
uint8_t
SerialGetDataSize(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig;
    uint8_t ucCurrentDataSize;

    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // Get the current configuration of the UART.
    //
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    //
    // Determine the current data size.
    //
    switch(ulCurrentConfig & UART_CONFIG_WLEN_MASK)
    {
        case UART_CONFIG_WLEN_5:
        {
            ucCurrentDataSize = 5;
            break;
        }

        case UART_CONFIG_WLEN_6:
        {
            ucCurrentDataSize = 6;
            break;
        }

        case UART_CONFIG_WLEN_7:
        {
            ucCurrentDataSize = 7;
            break;
        }

        case UART_CONFIG_WLEN_8:
        {
            ucCurrentDataSize = 8;
            break;
        }

        default:
        {
            ucCurrentDataSize = 0;
            break;
        }
    }

    //
    // Return the current data size.
    //
    return(ucCurrentDataSize);
}

//*****************************************************************************
//
//! Configures the serial port parity.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucParity is the new parity for the serial port.
//!
//! This function configures the serial port's parity.  The current
//! configuration for the serial port will be read.  The parity will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//
//*****************************************************************************
void
SerialSetParity(uint32_t ulPort, uint8_t ucParity)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig, ulNewConfig;

    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);
    ASSERT((ucParity == SERIAL_PARITY_NONE) ||
           (ucParity == SERIAL_PARITY_ODD) ||
           (ucParity == SERIAL_PARITY_EVEN) ||
           (ucParity == SERIAL_PARITY_MARK) ||
           (ucParity == SERIAL_PARITY_SPACE));

    //
    // Stop the UART.
    //
    UARTDisable(g_ulUARTBase[ulPort]);

    //
    // Get the current configuration of the UART.
    //
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    //
    // Update the configuration with a new parity.
    //
    switch(ucParity)
    {
        case SERIAL_PARITY_NONE:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_NONE;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_ODD:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_ODD;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_EVEN:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_EVEN;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_MARK:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_ONE;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        case SERIAL_PARITY_SPACE:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_PAR_MASK);
            ulNewConfig |= UART_CONFIG_PAR_ZERO;
            g_sParameters.sPort[ulPort].ucParity = ucParity;
            break;
        }

        default:
        {
            ulNewConfig = ulCurrentConfig;
            break;
        }
    }

    //
    // Set parity, data length, and number of stop bits.
    //
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) = ulNewConfig;

    //
    // Clear the flags register.
    //
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    //
    // Start the UART.
    //
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//
//! Queries the serial port parity.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured parity for the selected port.
//!
//! \return Returns the current parity setting for the port.  This will be one
//! of \b SERIAL_PARITY_NONE, \b SERIAL_PARITY_ODD, \b SERIAL_PARITY_EVEN,
//! \b SERIAL_PARITY_MARK, or \b SERIAL_PARITY_SPACE.
//
//*****************************************************************************
uint8_t
SerialGetParity(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig;
    uint8_t ucCurrentParity;

    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // Get the current configuration of the UART.
    //
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    //
    // Determine the current data size.
    //
    switch(ulCurrentConfig & UART_CONFIG_PAR_MASK)
    {
        case UART_CONFIG_PAR_NONE:
        {
            ucCurrentParity = SERIAL_PARITY_NONE;
            break;
        }

        case UART_CONFIG_PAR_ODD:
        {
            ucCurrentParity = SERIAL_PARITY_ODD;
            break;
        }

        case UART_CONFIG_PAR_EVEN:
        {
            ucCurrentParity = SERIAL_PARITY_EVEN;
            break;
        }

        case UART_CONFIG_PAR_ONE:
        {
            ucCurrentParity = SERIAL_PARITY_MARK;
            break;
        }

        case UART_CONFIG_PAR_ZERO:
        {
            ucCurrentParity = SERIAL_PARITY_SPACE;
            break;
        }

        default:
        {
            ucCurrentParity = SERIAL_PARITY_NONE;
            break;
        }
    }

    //
    // Return the current data size.
    //
    return(ucCurrentParity);
}

//*****************************************************************************
//
//! Configures the serial port stop bits.
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucStopBits is the new stop bits for the serial port.
//!
//! This function configures the serial port's stop bits.  The current
//! configuration for the serial port will be read.  The stop bits will be
//! modified, and the port will be reconfigured.
//!
//! \return None.
//
//*****************************************************************************
void
SerialSetStopBits(uint32_t ulPort, uint8_t ucStopBits)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig, ulNewConfig;

    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);
    ASSERT((ucStopBits >= 1) && (ucStopBits <= 2));

    //
    // Stop the UART.
    //
    UARTDisable(g_ulUARTBase[ulPort]);

    //
    // Get the current configuration of the UART.
    //
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    //
    // Update the configuration with a new stop bits.
    //
    switch(ucStopBits)
    {
        case 1:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_STOP_MASK);
            ulNewConfig |= UART_CONFIG_STOP_ONE;
            g_sParameters.sPort[ulPort].ucStopBits = ucStopBits;
            break;
        }

