ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
        case 2:
        {
            ulNewConfig = (ulCurrentConfig & ~UART_CONFIG_STOP_MASK);
            ulNewConfig |= UART_CONFIG_STOP_TWO;
            g_sParameters.sPort[ulPort].ucStopBits = ucStopBits;
            break;
        }

        default:
        {
            ulNewConfig = ulCurrentConfig;
            break;
        }
    }

    //
    // Set parity, data length, and number of stop bits.
    //
    HWREG(g_ulUARTBase[ulPort] + UART_O_LCRH) = ulNewConfig;

    //
    // Clear the flags register.
    //
    HWREG(g_ulUARTBase[ulPort] + UART_O_FR) = 0;

    //
    // Start the UART.
    //
    SerialUARTEnable(ulPort);
}

//*****************************************************************************
//
//! Queries the serial port stop bits.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will read the UART configuration and return the currently
//! configured stop bits for the selected port.
//!
//! \return None.
//
//*****************************************************************************
uint8_t
SerialGetStopBits(uint32_t ulPort)
{
    uint32_t ulCurrentBaudRate, ulCurrentConfig;
    uint8_t ucCurrentStopBits;

    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // Get the current configuration of the UART.
    //
    UARTConfigGetExpClk(g_ulUARTBase[ulPort], SysCtlClockGet(),
                        &ulCurrentBaudRate, &ulCurrentConfig);

    //
    // Determine the current data size.
    //
    switch(ulCurrentConfig & UART_CONFIG_STOP_MASK)
    {
        case UART_CONFIG_STOP_ONE:
        {
            ucCurrentStopBits = 1;
            break;
        }

        case UART_CONFIG_STOP_TWO:
        {
            ucCurrentStopBits = 2;
            break;
        }

        default:
        {
            ucCurrentStopBits = 0;
            break;
        }
    }

    //
    // Return the current data size.
    //
    return(ucCurrentStopBits);
}

//*****************************************************************************
//
//! Sets the serial port flow control output signal.
//!
//! \param ulPort is the UART port number to be accessed.
//! \param ucFlowValue is the value to program to the flow control pin.  Valid
//! values are \b SERIAL_FLOW_OUT_SET and \b SERIAL_FLOW_OUT_CLEAR.
//!
//! This function will set the flow control output pin to a specified value.
//!
//! \return None.
//
//*****************************************************************************
void
SerialSetFlowOut(uint32_t ulPort, uint8_t ucFlowValue)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);
    ASSERT((ucFlowValue == SERIAL_FLOW_OUT_SET) ||
           (ucFlowValue == SERIAL_FLOW_OUT_CLEAR));

    //
    // If we are to assert the pin, save the value and assert the pin.
    //
    if(ucFlowValue == SERIAL_FLOW_OUT_SET)
    {
        g_ulSetFlowOutValue[ulPort] = g_ulFlowOutPin[ulPort];
        GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort],
                     g_ulFlowOutPin[ulPort]);
    }

    //
    // If we are to deassert the pin, save the value, and deassert the pin
    // only if flow control would be deasserted anyway (in other words, the
    // fifo level is ok).
    //
    else
    {
        g_ulSetFlowOutValue[ulPort] = 0;

        //
        // If flow control is enabled, check the status of the RX buffer to
        // determine if flow control GPIO needs to be de-asserted.
        //
        if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
        {
            //
            // If the ring buffer is down to less than 25% used,
            // de-assert the outbound flow control pin.
            //
            if(RingBufUsed(&g_sRxBuf[ulPort]) <
               (RingBufSize(&g_sRxBuf[ulPort]) / 4))
            {
                GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort],
                             0);
            }
        }
        else
        {
            GPIOPinWrite(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort], 0);
        }
    }
}

//*****************************************************************************
//
//! Gets the serial port flow control output signal.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function will set the flow control output pin to a specified value.
//!
//! \return Returns \b SERIAL_FLOW_OUT_SET or \b SERIAL_FLOW_OUT_CLEAR.
//
//*****************************************************************************
uint8_t
SerialGetFlowOut(uint32_t ulPort)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // If flow control is set (ON) return an "11", otherwise, return
    // a "12" (based on the RFC2217 values).
    //
    if(GPIOPinRead(g_ulFlowOutBase[ulPort], g_ulFlowOutPin[ulPort]) ==
       g_ulFlowOutPin[ulPort])
    {
        return(SERIAL_FLOW_OUT_SET);
    }
    else
    {
        return(SERIAL_FLOW_OUT_CLEAR);
    }
}

//*****************************************************************************
//
//! Configures the serial port flow control option.
//!
//! \param ulPort is the UART port number to be accessed.
//! \param ucFlowControl is the new flow control setting for the serial port.
//!
//! This function configures the serial port's flow control.  This function
//! will enable/disable the flow control interrupt and the UART transmitter
//! based on the value of the flow control setting and/or the flow control
//! input signal.
//!
//! \return None.
//
//*****************************************************************************
void
SerialSetFlowControl(uint32_t ulPort, uint8_t ucFlowControl)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);
    ASSERT((ucFlowControl == SERIAL_FLOW_CONTROL_NONE) ||
           (ucFlowControl == SERIAL_FLOW_CONTROL_HW));

    //
    // Save the new flow control setting.
    //
    g_sParameters.sPort[ulPort].ucFlowControl = ucFlowControl;

    //
    // If flow control is enabled.
    //
    if(g_sParameters.sPort[ulPort].ucFlowControl == SERIAL_FLOW_CONTROL_HW)
    {
        //
        // Enable/Disable the transmitter, based on the flow control
        // input pin status.
        //
        if(GPIOPinRead(g_ulFlowInBase[ulPort], g_ulFlowInPin[ulPort]))
        {
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) &= ~UART_CTL_TXE;
        }
        else
        {
            HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
        }

        //
        // Enable the Flow Control interrupt.
        //
        IntEnable(g_ulFlowInterrupt[ulPort]);
    }

    //
    // If flow control is disabled.
    //
    else
    {
        //
        // Disable the Flow Control interrupt.
        //
        IntDisable(g_ulFlowInterrupt[ulPort]);

        //
        // Enable the transmitter.
        //
        HWREG(g_ulUARTBase[ulPort] + UART_O_CTL) |= UART_CTL_TXE;
    }
}

//*****************************************************************************
//
//! Queries the serial port flow control.
//!
//! \param ulPort is the serial port number to be accessed.
//!
//! This function will return the currently configured flow control for
//! the selected port.
//!
//! \return None.
//
//*****************************************************************************
uint8_t
SerialGetFlowControl(uint32_t ulPort)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // Return the current flow control.
    //
    return(g_sParameters.sPort[ulPort].ucFlowControl);
}

//*****************************************************************************
//
//! Purges the serial port data queue(s).
//!
//! \param ulPort is the serial port number to be accessed.
//! \param ucPurgeCommand is the command indicating which queue's to purge.
//!
//! This function will purge data from the tx, rx, or both serial port queues.
//!
//! \return None.
//
//*****************************************************************************
void
SerialPurgeData(uint32_t ulPort, uint8_t ucPurgeCommand)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);
    ASSERT((ucPurgeCommand >= 1) && (ucPurgeCommand <= 3));

    //
    // Disable the UART.
    //
    UARTDisable(g_ulUARTBase[ulPort]);

    //
    // Purge the receive data if requested.
    //
    if(ucPurgeCommand & 0x01)
    {
        RingBufFlush(&g_sRxBuf[ulPort]);
    }

    //
    // Purge the transmit data if requested.
    //
    if(ucPurgeCommand & 0x02)
    {
        RingBufFlush(&g_sTxBuf[ulPort]);
    }

    //
    // Renable the UART.
    //
    SerialUARTEnable(ulPort);
}
//#endif
//*****************************************************************************
//! Configures the serial port to a default setup.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function resets the serial port to a default configuration.
//!
//! \return None.
//*****************************************************************************
void SerialSetDefault(uint32_t ulPort)
{
    // Check the arguments.
    ASSERT(ulPort < MAX_S2E_PORTS);

    // Disable interrupts.
    IntDisable(g_ulUARTInterrupt[ulPort]);

    // Set the baud rate.
    SerialSetBaudRate(ulPort, g_psDefaultParameters->sPort[ulPort].ulBaudRate);

