ti-cortex-m4/tm4c1294ncpdt/ek-tm4c1294xl/project2/self/uart/serial.c
    // Set the data size.
    SerialSetDataSize(ulPort, g_psDefaultParameters->sPort[ulPort].ucDataSize);

    // Set the parity.
    SerialSetParity(ulPort, g_psDefaultParameters->sPort[ulPort].ucParity);

    // Set the stop bits.
    SerialSetStopBits(ulPort, g_psDefaultParameters->sPort[ulPort].ucStopBits);

    // Set the flow control.
    SerialSetFlowControl(ulPort, g_psDefaultParameters->sPort[ulPort].ucFlowControl);

    // Purge the Serial Tx/Rx Ring Buffers.
    SerialPurgeData(ulPort, 0x03);

    // (Re)enable the UART transmit and receive interrupts.
    UARTIntEnable(g_ulUARTBase[ulPort], (UART_INT_RX | UART_INT_RT | UART_INT_TX));
    IntEnable(g_ulUARTInterrupt[ulPort]);
}
//#if false
//*****************************************************************************
//
//! Configures the serial port according to the current working parameter
//! values.
//!
//! \param ulPort is the UART port number to be accessed.  Valid values are 0
//! and 1.
//!
//! This function configures the serial port according to the current working
//! parameters in g_sParameters.sPort for the specified port.  The actual
//! parameter set is then read back and g_sParameters.sPort updated to ensure
//! that the structure is correctly synchronized with the hardware.
//!
//! \return None.
//
//*****************************************************************************
void
SerialSetCurrent(uint32_t ulPort)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // Disable interrupts.
    //
    IntDisable(g_ulUARTInterrupt[ulPort]);

    //
    // Set the baud rate.
    //
    SerialSetBaudRate(ulPort, g_sParameters.sPort[ulPort].ulBaudRate);
    g_sParameters.sPort[ulPort].ulBaudRate = SerialGetBaudRate(ulPort);

    //
    // Set the data size.
    //
    SerialSetDataSize(ulPort, g_sParameters.sPort[ulPort].ucDataSize);
    g_sParameters.sPort[ulPort].ucDataSize = SerialGetDataSize(ulPort);

    //
    // Set the parity.
    //
    SerialSetParity(ulPort, g_sParameters.sPort[ulPort].ucParity);
    g_sParameters.sPort[ulPort].ucParity = SerialGetParity(ulPort);

    //
    // Set the stop bits.
    //
    SerialSetStopBits(ulPort, g_sParameters.sPort[ulPort].ucStopBits);
    g_sParameters.sPort[ulPort].ucStopBits = SerialGetStopBits(ulPort);

    //
    // Set the flow control.
    //
    SerialSetFlowControl(ulPort,
                      g_sParameters.sPort[ulPort].ucFlowControl);
    g_sParameters.sPort[ulPort].ucFlowControl = SerialGetFlowControl(ulPort);

    //
    // Purge the Serial Tx/Rx Ring Buffers.
    //
    SerialPurgeData(ulPort, 0x03);

    //
    // (Re)enable the UART transmit and receive interrupts.
    //
    UARTIntEnable(g_ulUARTBase[ulPort],
                 (UART_INT_RX | UART_INT_RT | UART_INT_TX));
    IntEnable(g_ulUARTInterrupt[ulPort]);
}

//*****************************************************************************
//
//! Configures the serial port to the factory default setup.
//!
//! \param ulPort is the UART port number to be accessed.
//!
//! This function resets the serial port to a default configuration.
//!
//! \return None.
//
//*****************************************************************************
void
SerialSetFactory(uint32_t ulPort)
{
    //
    // Check the arguments.
    //
    ASSERT(ulPort < MAX_S2E_PORTS);

    //
    // Disable interrupts.
    //
    IntDisable(g_ulUARTInterrupt[ulPort]);

    //
    // Set the baud rate.
    //
    SerialSetBaudRate(ulPort, g_psFactoryParameters->sPort[ulPort].ulBaudRate);

    //
    // Set the data size.
    //
    SerialSetDataSize(ulPort, g_psFactoryParameters->sPort[ulPort].ucDataSize);

    //
    // Set the parity.
    //
    SerialSetParity(ulPort, g_psFactoryParameters->sPort[ulPort].ucParity);

    //
    // Set the stop bits.
    //
    SerialSetStopBits(ulPort, g_psFactoryParameters->sPort[ulPort].ucStopBits);

    //
    // Set the flow control.
    //
    SerialSetFlowControl(ulPort,
                      g_psFactoryParameters->sPort[ulPort].ucFlowControl);

    //
    // Purge the Serial Tx/Rx Ring Buffers.
    //
    SerialPurgeData(ulPort, 0x03);

    //
    // (Re)enable the UART transmit and receive interrupts.
    //
    UARTIntEnable(g_ulUARTBase[ulPort],
                 (UART_INT_RX | UART_INT_RT | UART_INT_TX));
    IntEnable(g_ulUARTInterrupt[ulPort]);
}

//*****************************************************************************
//
//! Initializes the serial port driver.
//!
//! This function initializes and configures the serial port driver.
//!
//! \return None.
//
//*****************************************************************************
void
SerialInit(void)
{
    //
    // Initialize the ring buffers used by the UART Drivers.
    //
    RingBufInit(&g_sRxBuf[0], g_pucRX0Buffer, sizeof(g_pucRX0Buffer));
    RingBufInit(&g_sTxBuf[0], g_pucTX0Buffer, sizeof(g_pucTX0Buffer));
    RingBufInit(&g_sRxBuf[1], g_pucRX1Buffer, sizeof(g_pucRX1Buffer));
    RingBufInit(&g_sTxBuf[1], g_pucTX1Buffer, sizeof(g_pucTX1Buffer));

    //
    // Configure the Port 0 pins appropriately.
    //
    GPIOPinTypeUART(PIN_U0RX_PORT, PIN_U0RX_PIN);
    GPIOPinTypeUART(PIN_U0TX_PORT, PIN_U0TX_PIN);
    GPIOPinTypeGPIOInput(PIN_U0RTS_PORT, PIN_U0RTS_PIN);
    GPIOPinTypeGPIOOutput(PIN_U0CTS_PORT, PIN_U0CTS_PIN);
    GPIOPinWrite(PIN_U0CTS_PORT, PIN_U0CTS_PIN, 0);
    GPIOIntTypeSet(PIN_U0RTS_PORT, PIN_U0RTS_PIN, GPIO_BOTH_EDGES);
    GPIOIntEnable(PIN_U0RTS_PORT, PIN_U0RTS_PIN);
    IntEnable(PIN_U0RTS_INT);

    //
    // Configure the Port 1 pins appropriately.
    //
    GPIOPinTypeUART(PIN_U1RX_PORT, PIN_U1RX_PIN);
    GPIOPinTypeUART(PIN_U1TX_PORT, PIN_U1TX_PIN);
    GPIOPinTypeGPIOInput(PIN_U1RTS_PORT, PIN_U1RTS_PIN);
    GPIOPinTypeGPIOOutput(PIN_U1CTS_PORT, PIN_U1CTS_PIN);
    GPIOPinWrite(PIN_U1CTS_PORT, PIN_U1CTS_PIN, 0);
    GPIOIntTypeSet(PIN_U1RTS_PORT, PIN_U1RTS_PIN, GPIO_BOTH_EDGES);
    GPIOIntEnable(PIN_U1RTS_PORT, PIN_U1RTS_PIN);
    IntEnable(PIN_U1RTS_INT);

    //
    // Configure the RS-232 Transceiver pins appropriately.
    // (Note:  This is for Port 1 only).
    //
    GPIOPinTypeGPIOInput(PIN_XVR_INV_N_PORT, PIN_XVR_INV_N_PIN);
    GPIOPinTypeGPIOOutput(PIN_XVR_ON_PORT, PIN_XVR_ON_PIN);
    GPIOPinTypeGPIOOutput(PIN_XVR_OFF_N_PORT, PIN_XVR_OFF_N_PIN);
    GPIOPinTypeGPIOOutput(PIN_XVR_RDY_PORT, PIN_XVR_RDY_PIN);

    //
    // Enable the RS-232 Transciever.
    //
    GPIOPinWrite(PIN_XVR_RDY_PORT, PIN_XVR_RDY_PIN, 0);
    GPIOPinWrite(PIN_XVR_OFF_N_PORT, PIN_XVR_OFF_N_PIN, PIN_XVR_OFF_N_PIN);
    GPIOPinWrite(PIN_XVR_ON_PORT, PIN_XVR_ON_PIN, PIN_XVR_ON_PIN);

    //
    // Configure Port 0.
    //
    SerialSetDefault(0);

    //
    // Configure Port 1.
    //
    SerialSetDefault(1);
}

#endif
